Revit API Introduction Labs
LabUtils.GetOrCreateSharedParamsGroup Method
 Helper to get shared params group.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static DefinitionGroup GetOrCreateSharedParamsGroup(
	DefinitionFile sharedParametersFile,
	string groupName
)
Visual Basic (Declaration)
Public Shared Function GetOrCreateSharedParamsGroup ( _
	sharedParametersFile As DefinitionFile, _
	groupName As String _
) As DefinitionGroup
Visual C++
public:
static DefinitionGroup^ GetOrCreateSharedParamsGroup(
	DefinitionFile^ sharedParametersFile,
	String^ groupName
)
Parameters
sharedParametersFile
Type: DefinitionFile
groupName
Type: System.String
See Also
LabUtils Class
Labs Namespace